In [1]:
#CRear un Dataframe a partir de un diccionario
elementos={
    'Numero atómico':[1,6,47,88],
    'Masa atómica':[1.008,12.011,107.87,226],
    'Familia':['No Metal','No Metal','Metal','Metal']
}

elementos

{'Numero atómico': [1, 6, 47, 88],
 'Masa atómica': [1.008, 12.011, 107.87, 226],
 'Familia': ['No Metal', 'No Metal', 'Metal', 'Metal']}

In [2]:
import pandas as pd
tabla_periodica=pd.DataFrame(elementos)
tabla_periodica

   Numero atómico  Masa atómica   Familia
0               1         1.008  No Metal
1               6        12.011  No Metal
2              47       107.870     Metal
3              88       226.000     Metal

In [3]:
import pandas as pd
tabla_periodica=pd.DataFrame(elementos, index=['a','b','c','d'])
tabla_periodica

   Numero atómico  Masa atómica   Familia
a               1         1.008  No Metal
b               6        12.011  No Metal
c              47       107.870     Metal
d              88       226.000     Metal

In [5]:
unidades_datos={
    'Ag':[2,4,3],
    'Au':[5,6,2],
    'Pt':[2,2,1],
    'Cu':[3,7,4]
}
print(unidades_datos)

columnas=['Pt','Cu','Au','Ag']
filas=[2015,2016,2017]
unidades=pd.DataFrame(unidades_datos,index=filas,columns=columnas)
unidades

{'Ag': [2, 4, 3], 'Au': [5, 6, 2], 'Pt': [2, 2, 1], 'Cu': [3, 7, 4]}

      Pt  Cu  Au  Ag
2015   2   3   5   2
2016   2   7   6   4
2017   1   4   2   3

In [7]:
# Crear un DataFrame a partir de varios diccionarios, donde cada
#diccionario va a ser una fila del DataFrame
unidades_2015={'Ag':2,'Au':5,'Cu':3,'Pt':2}
unidades_2016={'Ag':4,'Au':6,'Cu':7,'Pt':2}
unidades_2017={'Ag':3,'Au':2,'Cu':4,'Pt':1}

unidades=pd.DataFrame([unidades_2015,unidades_2016,unidades_2017],
                     index=[2015,2016,2017])
unidades

      Ag  Au  Cu  Pt
2015   2   5   3   2
2016   4   6   7   2
2017   3   2   4   1

In [8]:
# Crear un DataFrame a partir de varios diccionarios, donde cada
#diccionario va a ser una fila del DataFrame
unidades_2015={'Ag':2,'Au':5,'Cu':3,'Pt':2}
unidades_2016={'Ag':4,'Au':6,'Cu':7,'Pt':2}
unidades_2017={'Ag':3,'Cu':4,'Pb':1}

unidades=pd.DataFrame([unidades_2015,unidades_2016,unidades_2017],
                     index=[2015,2016,2017])
unidades

      Ag   Au  Cu   Pt   Pb
2015   2  5.0   3  2.0  NaN
2016   4  6.0   7  2.0  NaN
2017   3  NaN   4  NaN  1.0

In [9]:
# MEtodo HEAD()

unidades.head(2)

      Ag   Au  Cu   Pt  Pb
2015   2  5.0   3  2.0 NaN
2016   4  6.0   7  2.0 NaN

In [10]:
# MEtodo HEAD()

unidades.head()

      Ag   Au  Cu   Pt   Pb
2015   2  5.0   3  2.0  NaN
2016   4  6.0   7  2.0  NaN
2017   3  NaN   4  NaN  1.0

In [11]:
import pandas as pd
entradas=pd.Series([12,33,55,43,4,5,33,23,343,33,23,56],
                  index=['ene','feb','mar','abr','may','jun','jul','ago','sep','oct','nov','dic'])

entradas

ene     12
feb     33
mar     55
abr     43
may      4
jun      5
jul     33
ago     23
sep    343
oct     33
nov     23
dic     56
dtype: int64

In [12]:
import pandas as pd
salidas=pd.Series([8,13,65,33,23,23,12,34,234,123,46,16],
                  index=['ene','feb','mar','abr','may','jun','jul','ago','sep','oct','nov','dic'])

salidas

ene      8
feb     13
mar     65
abr     33
may     23
jun     23
jul     12
ago     34
sep    234
oct    123
nov     46
dic     16
dtype: int64

In [13]:
salidas.head()

ene     8
feb    13
mar    65
abr    33
may    23
dtype: int64

In [14]:
salidas.head(3)

ene     8
feb    13
mar    65
dtype: int64

In [15]:
almacen=pd.DataFrame({'entradas':entradas,'salidas':salidas})
almacen

     entradas  salidas
ene        12        8
feb        33       13
mar        55       65
abr        43       33
may         4       23
jun         5       23
jul        33       12
ago        23       34
sep       343      234
oct        33      123
nov        23       46
dic        56       16

In [16]:
#Vamos a crear una nueva columna llamada neto a partir de operar
#las columnas de entradas - la columna de salidas
almacen['neto']=almacen.entradas-almacen.salidas
almacen

     entradas  salidas  neto
ene        12        8     4
feb        33       13    20
mar        55       65   -10
abr        43       33    10
may         4       23   -19
jun         5       23   -18
jul        33       12    21
ago        23       34   -11
sep       343      234   109
oct        33      123   -90
nov        23       46   -23
dic        56       16    40

In [17]:
almacen.head() #ME devuelve por defecto los 5 primeros elementos

     entradas  salidas  neto
ene        12        8     4
feb        33       13    20
mar        55       65   -10
abr        43       33    10
may         4       23   -19

In [18]:
almacen.head(6) #ME devuelve por defecto los 5 primeros elementos

     entradas  salidas  neto
ene        12        8     4
feb        33       13    20
mar        55       65   -10
abr        43       33    10
may         4       23   -19
jun         5       23   -18

In [19]:
#MEtodo tail me retorna por defecto los 5 ultimos elementos de un Dataframe
#o de una Serie, tambien recibe argumentos de los valores que queremos obtener
almacen.tail()

     entradas  salidas  neto
ago        23       34   -11
sep       343      234   109
oct        33      123   -90
nov        23       46   -23
dic        56       16    40

In [20]:
#MEtodo tail me retorna por defecto los 5 ultimos elementos de un Dataframe
#o de una Serie, tambien recibe argumentos de los valores que queremos obtener
almacen.tail(2)

     entradas  salidas  neto
nov        23       46   -23
dic        56       16    40

In [23]:
# MEtodo SAMPLE()
#Me retorna un valor por defecto de forma aleatoria
entradas.sample()

abr    43
dtype: int64

In [24]:
almacen.sample()

     entradas  salidas  neto
nov        23       46   -23

In [25]:
almacen.sample(3)

     entradas  salidas  neto
ene        12        8     4
oct        33      123   -90
jun         5       23   -18

In [26]:
#Metodo Describe
almacen.describe()

         entradas     salidas       neto
count   12.000000   12.000000   12.00000
mean    55.250000   52.500000    2.75000
std     92.214301   65.426572   46.59521
min      4.000000    8.000000  -90.00000
25%     20.250000   15.250000  -18.25000
50%     33.000000   28.000000   -3.00000
75%     46.000000   50.750000   20.25000
max    343.000000  234.000000  109.00000

In [29]:
almacen.entradas.describe()

count     12.000000
mean      55.250000
std       92.214301
min        4.000000
25%       20.250000
50%       33.000000
75%       46.000000
max      343.000000
Name: entradas, dtype: float64

In [28]:
almacen['entradas'].describe()

count     12.000000
mean      55.250000
std       92.214301
min        4.000000
25%       20.250000
50%       33.000000
75%       46.000000
max      343.000000
Name: entradas, dtype: float64

In [30]:
almacen.describe(include='all')

         entradas     salidas       neto
count   12.000000   12.000000   12.00000
mean    55.250000   52.500000    2.75000
std     92.214301   65.426572   46.59521
min      4.000000    8.000000  -90.00000
25%     20.250000   15.250000  -18.25000
50%     33.000000   28.000000   -3.00000
75%     46.000000   50.750000   20.25000
max    343.000000  234.000000  109.00000

In [31]:
almacen.describe(percentiles=[0,0.5,2/3,1])

         entradas     salidas        neto
count   12.000000   12.000000   12.000000
mean    55.250000   52.500000    2.750000
std     92.214301   65.426572   46.595210
min      4.000000    8.000000  -90.000000
0%       4.000000    8.000000  -90.000000
50%     33.000000   28.000000   -3.000000
66.7%   36.333333   38.000000   13.333333
100%   343.000000  234.000000  109.000000
max    343.000000  234.000000  109.000000

In [33]:
#Metodo info
almacen.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12 entries, ene to dic
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   entradas  12 non-null     int64
 1   salidas   12 non-null     int64
 2   neto      12 non-null     int64
dtypes: int64(3)
memory usage: 684.0+ bytes

In [34]:
tabla_periodica.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Numero atómico  4 non-null      int64
 1   Masa atómica    4 non-null      float64
 2   Familia         4 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 128.0+ bytes

In [38]:
# MEtodo value_counts
#Este metodo me cuenta el numero de ocurrencias de un elemento en 
#una serie o columna
import numpy as np
s=pd.Series([3,1,2,1,1,4,1,2,np.nan])
print(s)
s.value_counts()

0    3.0
1    1.0
2    2.0
3    1.0
4    1.0
5    4.0
6    1.0
7    2.0
8    NaN
dtype: float64

1.0    4
2.0    2
3.0    1
4.0    1
dtype: int64

In [39]:
#Dropna es un atributo que muestra las ocurrencias de los 
# valores nulos en la serie, cuando se utiliza el metodo value_counts
s.value_counts(dropna=False)

1.0    4
2.0    2
3.0    1
4.0    1
NaN    1
dtype: int64

In [40]:
#MEtodo que se llama dropna, este metodo me permite eliminar los 
#valores nulos de una fila en una serie o dataframe
s.dropna()

0    3.0
1    1.0
2    2.0
3    1.0
4    1.0
5    4.0
6    1.0
7    2.0
dtype: float64

In [41]:
#Utilizar el atributo bins
s.value_counts(bins=2)

(0.996, 2.5]    6
(2.5, 4.0]      2
dtype: int64

In [42]:
#Utilizar el atributo bins
s.value_counts(bins=[2,5])

(1.999, 5.0]    4
dtype: int64

In [43]:
import pandas as pd
s=pd.Series([10,20,30,40])
s

0    10
1    20
2    30
3    40
dtype: int64

In [44]:
s[3]

40

In [45]:
import pandas as pd
s=pd.Series([10,20,30,40],index=['a','b','c','d'])
s

a    10
b    20
c    30
d    40
dtype: int64

In [46]:
s['b']

20

In [47]:
s[-1]

40

# Filtrado de valores a partir de un rango

In [48]:
import pandas as pd
s=pd.Series([10,20,30,40],index=['a','b','c','d'])
s

a    10
b    20
c    30
d    40
dtype: int64

In [49]:
s[1:3] #La fila 1 se incluye, y la fila 3 se excluye

b    20
c    30
dtype: int64

In [50]:
s[1:]

b    20
c    30
d    40
dtype: int64

In [51]:
s[:3]

a    10
b    20
c    30
dtype: int64

In [53]:
s['a':'c'] 
#Cuando trabajamos con etiquetas, la fila del 
#indice 2 si va incluida

a    10
b    20
c    30
dtype: int64

In [54]:
s[:'c']

a    10
b    20
c    30
dtype: int64

In [57]:
s[:3] #EL indice 3 no se incluye

a    10
b    20
c    30
dtype: int64

In [55]:
s['b':]

b    20
c    30
d    40
dtype: int64

# Metodo iloc

Este metodo unicamente trabaja con los indices de las filas

In [58]:
import pandas as pd
s=pd.Series([10,20,30,40],index=['a','b','c','d'])
s

a    10
b    20
c    30
d    40
dtype: int64

In [59]:
s.iloc[1]

20

In [61]:
s.iloc['a'] #EL metodo iloc no funciona con etiquetas

TypeError: Cannot index by location index with a non-integer key

In [62]:
#indices negativos solo cuando las filas tienen etiquetas
s.iloc[-1]

40

In [63]:
# Voy a pasar en una lista las filas que quiero observar
s.iloc[[2,0,1]]

c    30
a    10
b    20
dtype: int64

In [64]:
# Voy a pasar en una lista las filas que quiero observar
s.iloc[[-2,0,-1]]

c    30
a    10
d    40
dtype: int64

In [65]:
# FIltrar los datos de una serie a partir de un rango de valores
s.iloc[1:3]

b    20
c    30
dtype: int64

In [66]:
s.iloc[:3]

a    10
b    20
c    30
dtype: int64

In [67]:
s.iloc[3:]

d    40
dtype: int64

In [68]:
s.iloc[1:-1]

b    20
c    30
dtype: int64

# Metodo loc

Este metodo permite trabajar con etiquetas

In [69]:
import pandas as pd
s=pd.Series([10,20,30,40],index=['a','b','c','d'])
s

a    10
b    20
c    30
d    40
dtype: int64

In [70]:
s.loc['a']

10

In [72]:
s.loc['b':'d'] #Cuando trabajamos con etiquetas el segundo argumento del rango si es incluido

b    20
c    30
d    40
dtype: int64

In [73]:
s.loc[0]

KeyError: 0

In [75]:
import pandas as pd
import numpy as np
df=pd.DataFrame(np.arange(12).reshape([4,3]),
                                     index=['a','b','c','d'],
                                     columns=['A','B','C'])
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [78]:
df.loc['a'] #estoy filtrando datos a partir de una fila en un Dataframe

A    0
B    1
C    2
Name: a, dtype: int64

In [81]:
df.loc['a':'c'] #estoy filtrando datos a partir de un rango de filas en un Dataframe

   A  B  C
a  0  1  2
b  3  4  5
c  6  7  8

In [83]:
df.loc['a':'c','A':'B'] #estoy filtrando datos a partir de un rango de filas en un Dataframe

   A  B
a  0  1
b  3  4
c  6  7

In [84]:
#Voy a modificar los valores de este rango seleccionado
df.loc['a':'c','A':'B']=[[-1,-1],[-2,-2],[-3,-3]]
df

   A   B   C
a -1  -1   2
b -2  -2   5
c -3  -3   8
d  9  10  11

In [85]:
#Voy a modificar los valores de este rango seleccionado
df.loc['a':'c','A':'B']=0
df

   A   B   C
a  0   0   2
b  0   0   5
c  0   0   8
d  9  10  11

# MEdiante el metodo loc podemos hacer filtros a partir de condiciones

In [89]:
import pandas as pd
import numpy as np
df=pd.DataFrame(np.arange(12).reshape([4,3]),
                                     index=['a','b','c','d'],
                                     columns=['A','B','C'])
df
print(df)
#Filtrado los datos de la columna B que cumplan con la condicion de que sean mayores
#que el valor de 4
df.loc[df.B>4]

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

   A   B   C
c  6   7   8
d  9  10  11

In [90]:
import pandas as pd
import numpy as np
df=pd.DataFrame(np.arange(12).reshape([4,3]),
                                     index=['a','b','c','d'],
                                     columns=['A','B','C'])
df
print(df)
# Podemos tener dos condicionales similiar a la conjuncion (and)

#Filtrado los datos de la columna B que cumplan con la condicion de que sean mayores
#que el valor de 4 y que los valores de la columna C sean mayores que 8

df.loc[(df.B>4) & (df.C>8)]

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

   A   B   C
d  9  10  11

In [92]:
import pandas as pd
import numpy as np
df=pd.DataFrame(np.arange(12).reshape([4,3]),
                                     index=['a','b','c','d'],
                                     columns=['A','B','C'])
df
print(df)
# Podemos tener dos condicionales similiar a la conjuncion (and)

#Filtrado los datos de la columna B que cumplan con la condicion de que sean mayores
#que el valor de 4 y que los valores de la columna C sean mayores que 8

df.iloc[(df.B>4).values & (df.C>8).values]

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

   A   B   C
d  9  10  11